In [3]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
import pandas as pd

## column rename

In [8]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
display(df)
df = df.rename(columns={"A": "a", "B": "b"})
display(df)
df = df.rename(str.upper, axis='columns')
display(df)

   A  B
0  1  4
1  2  5
2  3  6

   a  b
0  1  4
1  2  5
2  3  6

   A  B
0  1  4
1  2  5
2  3  6

## set cell value

In [15]:
df = pd.DataFrame(index=['idx1', 'idx2', 'idx3'], columns=['col1', 'col2'])
df['col1']['idx1'] = str(list([1,2,3]))
df

           col1 col2
idx1  [1, 2, 3]  NaN
idx2        NaN  NaN
idx3        NaN  NaN

## get cell value

In [18]:
display(df['col1']['idx1'])

'[1, 2, 3]'

## applymap, map -- how to

In [10]:
data = {
    'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
    'year': [2012, 2012, 2013, 2014, 2014],
    'reports': [4, 24, 31, 2, 3],
    'coverage': [25, 94, 57, 62, 70]
}
df = pd.DataFrame(
    data, index=['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
display(df)

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

In [11]:
# create a function called times100
def times100(x):
    # that, if x is a string,
    if type(x) is str:
        # just returns it untouched
        return x
    # but, if not, return it multiplied by 100
    elif x:
        return 100 * x
    # and leave everything else
    else:
        return

In [12]:
df.applymap(times100)

             name    year  reports  coverage
Cochice     Jason  201200      400      2500
Pima        Molly  201200     2400      9400
Santa Cruz   Tina  201300     3100      5700
Maricopa     Jake  201400      200      6200
Yuma          Amy  201400      300      7000

In [13]:
display(df)
df['coverage_x100'] = df['coverage'].map(times100)
display(df)

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

             name  year  reports  coverage  coverage_x100
Cochice     Jason  2012        4        25           2500
Pima        Molly  2012       24        94           9400
Santa Cruz   Tina  2013       31        57           5700
Maricopa     Jake  2014        2        62           6200
Yuma          Amy  2014        3        70           7000